IDEA StatiCa Open Model
ConnectionCheckRes.CheckResWeld Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of check results for welds
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<CheckResWeld> CheckResWeld { get; set; }
Public Property CheckResWeld As List(Of CheckResWeld)
	Get
	Set
public:
property List<CheckResWeld^>^ CheckResWeld {
	List<CheckResWeld^>^ get ();
	void set (List<CheckResWeld^>^ value);
}
Property Value
Type: List<CheckResWeld>
See Also
Reference
ConnectionCheckRes Class
IdeaRS.OpenModel.Connection Namespace